CSI API ETABS v1

# cAnalysisResultsSetupSetOptionBucklingMode Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOptionBucklingMode(
    	int BuckModeStart,
    	int BuckModeEnd,
    	bool BuckModeAll = false
    )

    Function SetOptionBucklingMode (
    	BuckModeStart As Integer,
    	BuckModeEnd As Integer,
    	Optional BuckModeAll As Boolean = false
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim BuckModeStart As Integer
    Dim BuckModeEnd As Integer
    Dim BuckModeAll As Boolean
    Dim returnValue As Integer

    returnValue = instance.SetOptionBucklingMode(BuckModeStart,
    	BuckModeEnd, BuckModeAll)

    int SetOptionBucklingMode(
    	int BuckModeStart,
    	int BuckModeEnd,
    	bool BuckModeAll = false
    )

    abstract SetOptionBucklingMode :
            BuckModeStart : int *
            BuckModeEnd : int *
            ?BuckModeAll : bool
    (* Defaults:
            let _BuckModeAll = defaultArg BuckModeAll false
    *)
    -> int

#### Parameters

BuckModeStart

    Type: SystemInt32

BuckModeEnd

    Type: SystemInt32

BuckModeAll (Optional)

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com